Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: འདི་ལྟར་དེས་གཟུགས་སྐྱེ་བའི་ཆོས་ཅན་ནམ་འགག་པའི་ཆོས་ཅན་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ནས། རང་བྱང་ཆུབ་དང་། སངས་རྒྱས་དང་། བྱང་ཆུབ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བའི་མཐའ་ལ་ཐུག་གི་བར་གྱིས་རྒྱས་པར་བསྟན་ཏོ།
en: It teaches this in detail, from “because they do not see form as qualified by production or qualified by stopping,” up to “they do not see a pratyekabuddha’s awakening, a buddha, or awakening.”

source: །འདི་ལྟར་དེས་གཟུགས་སྐྱེ་བའི་ཆོས་ཅན་ནམ་འགག་པའི་ཆོས་ཅན་ཞེས་བྱ་བ་ནི་སྐྱེ་བའི་ངོ་བོ་ཉིད་དམ་འགག་པའི་ངོ་བོ་ཉིད་ཅེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: The intrinsic nature of each—of form and so on, separately—that cannot be apprehended “Because they do not see form as qualified by production or qualified by stopping” means “has production as its intrinsic nature or has stopping as its intrinsic nature.”

source: །གལ་ཏེ་གཟུགས་སྐྱེ་བའི་ངོ་བོ་ཉིད་ཡིན་ན་ནི་འགག་པའི་ངོ་བོ་ཉིད་དུ་མི་འགྱུར་རོ། །གལ་ཏེ་འགག་པའི་ངོ་བོ་ཉིད་ཡིན་ན་སྐྱེ་བའི་ངོ་བོ་ཉིད་དུ་མི་འགྱུར་ཏེ། དངོས་པོ་གཅིག་ལ་རང་བཞིན་གཉིས་ཡོད་པ་ཤིན་ཏུ་འགལ་བའི་ཕྱིར་རོ།
en: If form had production as its intrinsic nature, it would not have stopping as its intrinsic nature; if it had stopping as its intrinsic nature, it would not have production as its intrinsic nature, because the existence of two intrinsic natures in one thing is a complete contradiction.

source: །གལ་ཏེ་གཟུགས་ལ་སྐྱེ་བ་ཞེས་བྱ་བའི་ཆོས་ཤིག་ཡོད་ན་ཡང་། བདག་ལས་སྐྱེ་བའམ། གཞན་ལས་སྐྱེའམ། གཉིས་ཀ་ལས་སྐྱེའམ། རྒྱུ་མེད་པ་ལས་སྐྱེ་བར་འགྱུར་རམ་ཞེས་རྣམ་པར་རྟོག་པ་བཞིར་འགྱུར་རོ།
en: Were a form to have the dharma called production, there would be four ways to conceive of it: as being produced from itself, produced from other, produced from both, or produced without a cause.

source: །དེ་ལ་བདག་ལས་སྐྱེ་བ་ནི་མི་རིགས་ཏེ། དེའི་ཚེ་ཆོས་མ་སྐྱེས་པའི་ཕྱིར་རོ། །མེད་པའི་བདག་ཉིད་ནི་སྐྱེ་བའི་རྒྱུར་མི་རུང་བའི་ཕྱིར་རོ།
en: Of these, it is not logical that it is produced from itself because at that time it is a dharma that has not been produced, and a nonexistent entity is not suitable to be the cause of production.

source: །གལ་ཏེ་སྐྱེ་བའི་སྔོན་རོལ་ན་ཆོས་དེ་ཡོད་པར་འགྱུར་དུ་ནི་དེ་ཡང་མི་རིགས་ཏེ་ཡོད་པ་ནི་ཡང་སྐྱེ་བར་མི་རིགས་པའི་ཕྱིར་རོ།
en: Were that dharma to exist prior to production that also would be illogical, because the production again of something that already exists is illogical.

source: །ཡོད་པ་ལས་སྐྱེ་བར་རྟག་ན་ནི་དུས་ཐམས་ཅད་དུ་སྐྱེ་བར་འགྱུར་ཏེ། ནམ་ཡང་མི་སྐྱེ་བར་མི་འགྱུར་རོ།
en: When you investigate a production from something that exists, the production would happen at all times and there would never be nonproduction.

source: །དེ་བས་བདག་ལ་སྐྱེ་བ་མི་རིགས་སོ།
en: Hence production from self is illogical.

source: །གཞན་ལས་སྐྱེ་བ་ཡང་མི་རིགས་ཏེ། གལ་ཏེ་གཞན་ལས་གཞན་དག་སྐྱེ་བར་འགྱུར་ན་ནི་ཐམས་ཅད་ལས་ཐམས་ཅད་སྐྱེ་བར་འགྱུར་རོ།
en: Production from other is illogical too, because if other things were produced from something other, then everything would be produced from everything.

source: །གཉིས་ཀ་ལས་སྐྱེ་ཞེས་བྱ་བར་ཡང་སྐྱོན་དེ་གཉིས་ལས་མི་ཐར་རོ།
en: And production from both does not escape those two faults either.

source: །རྒྱུ་མེད་པ་ལས་སྐྱེ་བར་ཡང་མི་རིགས་ཏེ། ཐམས་ཅད་དུ་ཐམས་ཅད་ལས་སྐྱེ་བར་འགྱུར་བའི་ཕྱིར་རོ།
en: Production without a cause is also illogical because everything would be produced everywhere.

source: །དེ་ལྟར་རྣམ་པར་དཔྱད་ན་དོན་དམ་པར་སྐྱེ་བ་མེད་དེ།
en: When you analyze like that, ultimately there is no production.

source: ཇི་སྐད་དུ་བདག་ལས་མ་ཡིན་གཞན་ལས་མིན། །གཉིས་ལས་མ་ཡིན་རྒྱུ་མེད་མིན། །དངོས་པོ་གང་དག་གང་ན་ཡང་། །སྐྱེ་བ་ནམ་ཡང་ཡོད་མ་ཡིན། །ཞེས་བྱ་བ་བཤད་པ་ལྟ་བུའོ།
en: As it is said, There are never any thingsAnywhere producedFrom self, other, both,Or without a cause.

source: །འགག་པའི་ཆོས་ཅན་དུ་འང་མི་རིགས་ཏེ། སྐྱེ་བ་མེད་པའི་ཕྱིར་རོ།
en: It is not logical that it has the dharma of stopping either, because it has no production.

source: །འདི་ལྟར་སྐྱེས་པ་ནི་འགག་པར་འགྱུར་གྱི་མ་སྐྱེས་པ་ནི་འགག་པར་མི་འགྱུར་རོ།
en: Thus, something produced stops, and something not produced does not stop.

source: །གཞན་ཡང་གལ་ཏེ་འགག་པ་ཞེས་བྱ་བའི་ཆོས་ཤིག་ཡོད་པར་གྱུར་ན་ནི་ཡོད་པ་འམ་མེད་པའི་ཆོས་ཤིག་ཡིན་གྲང་ན།
en: Furthermore, if there were a dharma called stopped, would it be categorized as a dharma that exists or that does not exist?

source: དེ་ལ་ཡོད་ན་ནི་འགག་པར་མི་འཐད་དེ། །ཡོད་པ་དང་མེད་པ་གཉིས་དངོས་པོ་གཅིག་ལ་མི་སྲིད་པའི་ཕྱིར་རོ།
en: Of these, if it does exist it is not feasible that it stops because both existing and not existing are impossible in one thing.

source: །མེད་པ་ཡང་འགག་པར་མི་འཐད་དེ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་རོ།
en: If it does not exist, it is not tenable that it stops because it is nonexistent.

source: །འདི་ལྟར་རི་བོང་གི་རྭ་ལ་འགག་པ་ཡོད་དོ་ཞེས་བྱར་མི་རུང་སྟེ། དངོས་པོ་ཀུན་གྱི་སྐྱེ་བ་དག །མི་འཐད་པ་ནི་གང་ཡིན་པ།
en: Thus, like a rabbit’s horn, to say “it stops” is unsuitable.

source: །དེ་ཉིད་དངོས་པོ་ཐམས་ཅད་ཀྱི། །འགག་པ་འཐད་པ་མ་ཡིན་པའོ།
en: Again, it is said, If just that producingOf all things is not feasible,Then the stoppingOf all things is not feasible.

source: །ཡོད་པ་དང་ནི་མེད་པ་གཉིས། །གཅིག་ལ་འཐད་པ་མ་ཡིན་ནོ།
en: Existing and not existingAre not feasible in one thing.

source: །ཡོད་པ་མིན་པའི་དངོས་པོ་ལ། །འགག་པ་འཐད་པ་མ་ཡིན་ཏེ། །ཇི་ལྟར་མགོ་ལ་ལན་གཉིས་སུ། །བཅད་དུ་མེད་པ་དེ་བཞིན་ནོ། །ཞེས་ཀྱང་བཤད་དོ།
en: Stopping what does not existIs also not feasible,Just as there isNo second decapitation.

source: །དེ་བས་ན་སྐྱེ་བ་ཞེས་བྱ་བ་དང་། འགག་པ་ཞེས་བྱ་བ་དེ་ནི་ཀུན་བརྟགས་པ་ཡིན་ཏེ།
en: Thus production and stopping are imaginary phenomena, simply just conventions.

source: ཐ་སྙད་ཙམ་དུ་ཟད་ཀྱི་དོན་དམ་པར་ནི་མེད་དོ།
en: They do not ultimately exist.

source: །དེ་བས་ན་གཟུགས་སྐྱེ་བའི་ཆོས་ཅན་ནམ། འགག་པའི་ཆོས་ཅན་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་གསུངས་སོ། །དེ་བཞིན་དུ་གཟུགས་ལ་སོགས་པ་ཀུན་ནས་ཉོན་མོངས་པའམ། རྣམ་པར་བྱང་བར་མི་འཐད་དེ།
en: Thus, it says, “Because they do not see form as qualified by production or qualified by stopping…” Similarly, “defilement” or “purification” of form and so on is not feasible.

source: གལ་ཏེ་དངོས་པོ་རྣམས་ཀུན་ནས་ཉོན་མོངས་པའི་ངོ་བོ་ཉིད་ཡིན་ན། ངོ་བོ་ཉིད་ནི་བཏང་བར་མི་ནུས་པའི་ཕྱིར་ནམ་ཡང་རྣམ་པར་བྱང་བར་མི་འགྱུར་རོ།
en: Were something to be defilement in its intrinsic nature, purification would never happen because an intrinsic nature is not something that can be given up.

source: །གལ་ཏེ་རྣམ་པར་བྱང་ཞིང་ཡོངས་སུ་དག་པའི་ངོ་བོ་ཉིད་ཡིན་ན་ནི་ངོ་བོ་ཉིད་བཏང་དུ་མི་རུང་བའི་ཕྱིར་ནམ་ཡང་ཆོས་རྣམས་ཀུན་ནས་ཉོན་མོངས་པར་མི་འགྱུར་རོ།
en: If it were to be qualified by purification, thoroughly pure in its intrinsic nature, defilement would never happen.

source: །གཞན་ཡང་གལ་ཏེ་ཆོས་རྣམས་ཀུན་ནས་ཉོན་མོངས་པ་ཞིག་ཡིན་ན་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པ་འམ། །རྣམ་པར་དག་པ་ལས་འགྱུར་གྲང་ན།
en: Furthermore, if dharmas have become a defilement you can suppose it happens to what was a defilement or was pure.

source: གལ་ཏེ་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པ་རྣམས་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་ན་ནི་ཀུན་ནས་ཉོན་མོངས་པ་དོན་མེད་པར་འགྱུར་ཏེ། ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་ཟིན་པ་རྣམས་ལ་ཡང་ཀུན་ནས་ཉོན་མོངས་པ་བསྐྱེད་མི་དགོས་པའི་ཕྱིར་རོ།
en: If what were defilement became defiled, defilement would be meaningless because you do not have to produce defilement in what is already defiled.

source: །ཡང་གཅིག་ཏུ་ན་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་དང་ཡང་སྐྱེ་བ་ནམ་ཡང་རྣམ་པར་བྱང་བར་མི་འགྱུར་རོ།
en: And as long as that is the case, defilement would be produced again and again, and purification would never happen.

source: །རྣམ་པར་དག་པ་རྣམས་ཀྱང་ཀུན་ནས་ཉོན་མོངས་པར་མི་འཐད་དེ་འགལ་བའི་ཕྱིར་རོ། །དངོས་པོ་གཅིག་ལ་ཀུན་ནས་ཉོན་མོངས་པ་དང་།
en: And it is also not feasible that that which is pure are the defilements because that entails a contradiction.

source: རྣམ་པར་དག་པ་གཉིས་ཅིག་ཅར་འབྱུང་བ་མི་འཐད་དེ། ངོ་བོ་ཉིད་གཉིས་མེད་པའི་ཕྱིར་རོ། །དེ་བཞིན་དུ་རྣམ་པར་བྱང་བ་ཡང་ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པའམ། རྣམ་པར་དག་པ་ལས་འགྱུར་གྲང་ན།
en: Similarly, with purification, you can suppose it happens to what was a defilement or was pure.

source: ཀུན་ནས་ཉོན་མོངས་པར་གྱུར་པ་ལ་ནི་རྣམ་པར་བྱང་བ་མེད་དེ། ཆོས་དེ་གཉིས་འགལ་བའི་ཕྱིར་རོ།
en: There could be no purification of what was a defilement because those two things exclude each other.

source: །རྣམ་པར་དག་པ་ཡང་རྣམ་པར་བྱང་བར་མི་རིགས་ཏེ། རྣམ་པར་དག་པས་དོན་མེད་པའི་ཕྱིར་རོ།
en: And it is also illogical that purification is of that which is pure, because it is pure, so that would be meaningless.

source: །དེ་བས་ན་ཀུན་ནས་ཉོན་མོངས་པ་དང་། རྣམ་པར་བྱང་བ་དོན་དམ་པར་ཡོད་པ་མ་ཡིན་གྱི། ངོ་བོ་ཉིད་ཀྱིས་རྣམ་པར་དག་པའི་དེ་བཞིན་ཉིད་ལ་སོ་སོའི་སྐྱེ་བོའི་གནས་སྐབས་ན་གློ་བུར་གྱི་ཀུན་ནས་ཉོན་མོངས་པ་ལ། ཀུན་ནས་ཉོན་མོངས་པ་ཞེས་གདགས་ཤིང་རྣམ་པར་དག་པའི་གནས་སྐབས་ན་གློ་བུར་གྱི་ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་ལ་རྣམ་པར་བྱང་བ་ཞེས་གདགས་པར་ཟད་དེ།
en: Hence, defilement and purification are ultimately not there, but still, onto the suchness that is pure in its intrinsic nature, during the ordinary person phase, defilement that is just plucked out of thin air is merely labeled as defilement, and during the pure phase the nonexistence of the defilement that is plucked out of thin air is merely labeled as purification.

source: གཟུགས་ལ་སོགས་པའི་ཆོས་ཉིད་དུ་ནི་མི་རིགས་སོ།
en: It is not feasible that they are the true dharmic nature of form and so on.

source: །དེའི་ཕྱིར་གཟུགས་ཀུན་ནས་ཉོན་མོངས་པའི་ཆོས་ཅན་ནམ། རྣམ་པར་བྱང་བའི་ཆོས་ཅན་དུ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་གསུངས་སོ།
en: Thus it says, “They do not see form as qualified by defilement or qualified by purification.”

source: །དེ་ལྟར་གཟུགས་ལ་སོགས་པ་ལ་ངོ་བོ་ཉིད་མེད་པའི་ཚུལ་བསྟན་ནས།
en: The intrinsic nature of them as a collection that cannot be apprehended Thus, how form and so on have no intrinsic nature has been explained.

source: ད་ནི་གཟུགས་ནི་ཚོར་བ་དང་ལྷན་ཅིག་ཡང་དག་པར་འདུ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་ཞེས་བྱ་བ་ལ་སོགས་པས་འདུས་པ་ལ་ཕུང་པོའི་མཚན་ཉིད་མེད་པར་སྟོན་ཏེ་ཕུང་པོ་ཞེས་བྱ་བ་ནི་སྤུངས་པ་ཞེས་བྱ་བའི་དོན་ཡིན་ལ།
en: Now, they “do not see ‘a confluence of form with feeling,’ ” and so on, teaches that a collection does not have the defining mark of an aggregate. An aggregate means they have aggregated.

source: སྤུངས་པ་ཡང་དག་པར་འདུ་བ་ཡོད་ན་སྲིད་པར་འགྱུར་ན། ཇི་ལྟར་ཆོས་རྣམས་ལ་ཡང་དག་པར་འདུ་བ་མེད་དེ།
en: It would exist were it possible that those that have aggregated are a confluence, but there is no confluence of dharmas.

source: དེ་བས་ན་ཕུང་པོའི་མཚན་ཉིད་ཀྱང་མེད་དོ་ཞེས་བསྟན་པའོ།
en: Hence it has taught that “there is not even the defining mark of an aggregate.”

source: །ཆོས་རྣམས་ལྷན་ཅིག་ཡང་དག་པར་འདུ་ན་ཡང་། འཁྲུལ་པ་ཡོད་པའམ་མཚན་ཉིད་གཅིག་པ་ཞིག་ཏུ་འགྱུར་གྲང་ན།
en: Suppose there were a confluence of dharmas—still it would be unmistaken, or it would have one defining mark.

source: གཟུགས་ནི་ཚོར་བ་ལ་སོགས་པ་དང་ལྷན་ཅིག་འཁྲུལ་པ་མེད་པ་མ་ཡིན་ཞིང་མཚན་ཉིད་ཐ་དད་དོ།
en: As for form, it is not together with feeling and so on and unmistaken. They have different defining marks.

source: །དེ་བཞིན་དུ་ཚོར་བ་ལ་སོགས་པ་ཡང་གཟུགས་དང་ལྷན་ཅིག་ཡང་དག་པར་འདུ་བ་མི་རིགས་སོ།
en: Similarly, it is not feasible that feeling and so on is together in a confluence with form.

source: །དེ་བཞིན་དུ་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་རྣམས་ཀྱང་མཚན་ཉིད་སོ་སོ་ཐ་དད་དེ། མཚན་ཉིད་སོ་སོ་ཞིང་ཤིན་ཏུ་ཐ་དད་པ་དེ་དག་ཇི་ལྟར་ཕུང་པོའི་ངོ་བོ་ཉིད་གཅིག་ཏུ་ཡང་དག་པར་འདུ་བར་འགྱུར།
en: And so too with feeling, perception, volitional factors, and consciousness—each has its own particular defining mark, so how could those things that have their own marks and are completely different be in a confluence in an aggregate with a single intrinsic nature?

source: གཞན་ཡང་གཟུགས་དང་ཚོར་བ་ལ་སོགས་པ་ལས་གཟུགས་དང་ཚོར་བ་ལ་སོགས་པའི་བདག་ཉིད་གང་ཡིན་པ་དེ་དག་ནི་ཀུན་བརྟགས་པ་སྟེ། སྒྱུ་མ་ལྟ་བུ་ཡིན་པར་རང་བཞིན་གྱིས་སྟོང་ངོ་།
en: Furthermore, beside form, feeling and so on, those phenomena that are constituted of form and feeling and so on are imaginary, are like an illusion, empty of a basic nature.

source: །དེ་ལ་ཇི་ལྟར་སྒྱུ་མའི་དངོས་པོ་རྟ་དང་གླང་པོ་ཆེ་ལ་སོགས་པ་དོན་དམ་པར་གཅིག་ཏུ་འདུ་བ་མེད་པ་དེ་བཞིན་དུ་ཀུན་བརྟགས་པའི་གཟུགས་ལ་སོགས་པ་ཡང་གཅིག་ཏུ་འདུ་བ་མེད་དོ།
en: Just as things like illusory horses and elephants and so on are not ultimately collected into one, similarly imaginary form and so on are also not collected into one.

source: །གཟུགས་ལ་སོགས་པའི་དེ་བཞིན་ཉིད་ཀྱི་བདག་ཉིད་གང་ཡིན་པ་དེ་ཡང་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཁོ་ནའོ།
en: Those that are constituted of the suchnesses of form and so on are also just empty of a basic nature.

source: །དེ་ལ་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཞེས་བྱ་བས་ནི་ཇི་ལྟར་ནམ་མཁའ་ནམ་མཁའ་དང་ལྷན་ཅིག་འདུ་བ་མེད་པ་ལྟར་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་སོགས་པ་ཡང་དེ་བཞིན་ནོ་ཞེས་སྟོན་ཏོ། །འདི་ནི་སྒོ་ཙམ་ཞིག་བསྟན་པར་ཟད་དེ། འདི་ལྟར་གཟུགས་ནི་ཚོར་བ་ལ་སོགས་པ་དང་ལྷན་ཅིག་འདུ་བ་མེད།
en: There, “because they are empty of a basic nature” teaches that just as space is not collected together with space, so too with the true dharmic natures of form and so on.

source: ཚོར་བ་ལ་སོགས་པ་ཡང་གཟུགས་དང་ལྷན་ཅིག་འདུ་བ་མེད།
en: This just teaches the heading.

source: ཚོར་བ་ནི་འདུ་ཤེས་པ་ལ་སོགས་པ་དང་ལྷན་ཅིག་འདུ་བ་མེད་འདུ་ཤེས་ལ་སོགས་པ་ཡང་ཚོར་བ་དང་ལྷན་ཅིག་འདུ་བ་མེད། འདུ་ཤེས་ནི་འདུ་བྱེད་ལ་སོགས་པ་དང་ལྷན་ཅིག་འདུ་བ་མེད། འདུ་བྱེད་ལ་སོགས་པ་ཡང་འདུ་ཤེས་དང་ལྷན་ཅིག་འདུ་བ་མེད། འདུ་བྱེད་ནི་རྣམ་པར་ཤེས་པ་དང་ལྷན་ཅིག་འདུ་བ་མེད། རྣམ་པར་ཤེས་པ་ཡང་འདུ་བྱེད་དང་ལྷན་ཅིག་འདུ་བ་མེད་དོ་ཞེས་བྱ་བར་སྦྱར་བར་བྱའོ།། །།
en: Thus connect this with: form is not collected together with feeling, and feeling and so on are not collected together with form; feeling is not collected together with perception and so on, and perception and so on are not collected together with feeling; perception is not collected together with volitional factors and so on, and volitional factors and so on are not collected together with perception; and volitional factors are not collected together with consciousness, and consciousness is not collected together with volitional factors.

source: བམ་པོ་བདུན་པ། ད་ནི་གཟུགས་ལ་སོགས་པ་དེ་དག་གི་རང་གི་མཚན་ཉིད་བསལ་བའི་ཕྱིར། གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་གཟུགས་མ་ཡིན་ཞེས་བྱ་བ་ལ་སོགས་པ་བསྟན་ཏོ།
en: Their defining marks that cannot be apprehended Now, to eliminate those specific defining marks of form and so on, it teaches “that emptiness of form is not form,” and so on.

source: །དེ་ལྟར་སྟོང་པ་ཉིད་ལ་བརྩོན་པར་བྱས་ན་གཟུགས་ལ་སོགས་པ་ཀུན་བརྟགས་པ་རྣམས་གཟུགས་ལ་སོགས་པའི་མཚན་ཉིད་དུ་མི་སྣང་གི། དེ་དག་སྟོང་པ་ཉིད་ཀྱི་མཚན་ཉིད་དུ་སྣང་སྟེ། དེའི་ཚེ་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་དག་གཟུགས་མ་ཡིན་ནོ་ཞེས་བསྟན་ཏོ།
en: Thus, it teaches that when they have engaged in the correct practice of emptiness, and imaginary form, and so on not appearing as the mark of form and so on, but appearing as the mark of emptiness, at that time “that emptiness of form is not form.”

source: །དེ་ཅིའི་ཕྱིར་སྙམ་པ་ལ།
en: Thinking, “And why?”

source: ཤཱ་རིའི་བུ་འདི་ལྟར་གཟུགས་ཀྱི་སྟོང་པ་ཉིད་གང་ཡིན་པ་དང་གཟུགས་སུ་ཡོད་པ་མ་ཡིན་ནོ་ཞེས་གསུངས་ཏེ། གཟུགས་སུ་ཡོད་པའི་མཚན་ཉིད་ལ་ནི་གཟུགས་ཞེས་བྱ་ན། འདི་ལྟར་སྟོང་པ་ཉིད་ལ་ནི་གཟུགས་སུ་མེད་དེ། དེའི་ཕྱིར་གཟུགས་མ་ཡིན་ནོ། འདི་ལྟར་ཚོར་བར་བྱེད་པ་མེད་དེ།
en: it says, “Because, Śāriputra, that emptiness of form is not seeable.”

source: དེའི་ཕྱིར་ཚོར་བ་མ་ཡིན་ནོ།
en: Form is the word used when there is the defining mark seeable.

source: །འདི་ལྟར་འདུས་ནས་ཤེས་པ་མེད་དེ། དེའི་ཕྱིར་འདུ་ཤེས་མ་ཡིན་ནོ། །འདི་ལྟར་མངོན་པར་འདུ་བྱེད་པ་མེད་དེ། དེའི་ཕྱིར་འདུ་བྱེད་རྣམས་མ་ཡིན་ནོ། །འདི་ལྟར་སྟོང་པ་ཉིད་དེ་ལ་རྣམ་པར་ཤེས་པར་བྱེད་པ་མེད་དེ།
en: Thus, in emptiness there is nothing that shows itself, so it is not form; thus there is no “experience,” so it is not feeling; thus there is no “being collected together and knowing,” so it is not perception; thus there is no “occasioning anything,” so it is not volitional factors; thus, in that emptiness there is no “making conscious,” so it is not consciousness.

source: དེའི་ཕྱིར་རྣམ་པར་ཤེས་པ་མ་ཡིན་ནོ། །འདི་ལྟར་གཟུགས་ལ་སོགས་པ་དེ་དག་གི་རང་གི་མཚན་ཉིད་བསལ་ཏེ།
en: Thus, those specific defining marks of form and so on are eliminated.

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། གལ་ཏེ་གཟུགས་ལ་སོགས་པ་གཟུགས་སུ་རུང་བ་ལ་སོགས་པའི་མཚན་ཉིད་དུ་མེད་ན། འོ་ན་ནི་གཟུགས་ལ་སོགས་པའི་སྒྲ་ཡུལ་མེད་པར་འགྱུར་རོ་སྙམ་དུ་ཐེ་ཚོམ་ཟོས་ནས། དེ་ཅིའི་སླད་དུ་ཞེས་ཞུས་པ་དང་།
en: Having said that, entertaining the doubt that if the defining mark that is being seeable and so on is not there, the words for form and so on will not refer to anything, it says, “And why?”

source: གཟུགས་ལ་སོགས་པའི་སྒྲ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་སོགས་པ་ལ་བྱ་སྟེ། དེ་བས་ན་སྟོང་པ་ཉིད་དང་གཟུགས་ལ་སོགས་པ་ལ་ཐ་དད་པ་མེད་པར་གཟུགས་ཀྱང་རང་བཞིན་མ་ཡིན་ལ། སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན་ནོ། །སྟོང་པ་ཉིད་ཀྱང་གཞན་མ་ཡིན་ལ་གཟུགས་ཀྱང་གཞན་མ་ཡིན་ནོ་ཞེས་བྱ་བས་བསྟན་ཏོ།
en: and with, “Because… form is not one thing and emptiness another; emptiness is not one thing and form another,” it teaches that the words for form and so on should be taken to refer to the form and so on that is its true dharmic nature, that emptiness and form and so on are not different.

source: །དེ་བས་ན་ཐམས་ཅད་དུ་ཡང་གཟུགས་ལ་སོགས་པའི་སྒྲ་ནི་སྟོང་པ་ཉིད་ལ་བྱ་སྟེ། སྟོང་པ་ཉིད་ཀྱི་སྒྲ་ཡང་ཆོས་ཉིད་ཀྱི་གཟུགས་ལ་སོགས་པ་ལ་བྱ་བར་གཟུགས་ཉིད་ཀྱང་སྟོང་པ་ཉིད་ལ་སྟོང་པ་ཉིད་ཀྱང་གཟུགས་སོ་ཞེས་བྱ་བས་བསྟན་ཏོ།
en: The totality of dharmas that cannot be apprehended Therefore, with “form is itself emptiness, and emptiness is form,” it teaches that all dharmas as a totality, as well as the words for form and so on, should be taken to refer to emptiness, and the word for emptiness should be taken to refer to the form and so on that is its true dharmic nature.

source: །སྔར་སྨོས་པའི་སྟོང་པ་ཉིད་ཀྱིས་རྣམ་པ་ཐམས་ཅད་བསྟན་ཏོ།
en: The emptiness spoken of earlier teaches all aspects.

source: །ཤཱ་རིའི་བུ་སྟོང་པ་ཉིད་ནི་མི་སྐྱེ་མི་འགག་ཅེས་བྱ་བ་ལ་སོགས་པ་ནི་སྐྱེ་བ་དང་འགག་པ་ཉིད་ཀྱི་ཕྱིར། འགྲིབ་པ་མེད་ཅིང་འཕེལ་བ་མེད་པ་སྟེ། འདས་པའང་མ་ཡིན། མ་འོངས་པ་ཡང་མ་ཡིན། ད་ལྟར་བྱུང་བ་ཡང་མ་ཡིན་ནོ།
en: As for, “Śāriputra, that emptiness is not produced and does not stop,” and so on, because of being produced and stopping, it “does not decrease and does not increase,” so it “is not past, is not future, and is not present.”

source: །གཟུགས་ལ་སོགས་པའི་མཚན་ཉིད་མེད་པའི་ཕྱིར་ཆོས་ཐམས་ཅད་ཀྱང་དེ་ལ་དམིགས་སུ་མེད་དེ། དེ་བས་ན་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་དེ་ལ་ནི་གཟུགས་མེད་དོ། །ཚོར་བ་མེད་དོ། །འདུ་ཤེས་མེད་དོ་ཞེས་བྱ་བ་ནས། སངས་རྒྱས་མེད་དོ། །བྱང་ཆུབ་མེད་དོ་ཞེས་བྱ་བའི་བར་གྱིས་སྟོན་ཏོ། །དེ་ལྟར་རྣམ་པ་བཅུ་གཅིག་གིས་བརྩོན་པའི་མཚན་ཉིད་བསྟན་ནས། དེའི་འོག་ཏུ་བདག་ལ་བརྩོན་ཞེས་བྱ་བ་དང་། མི་བརྩོན་ཞེས་བྱ་བའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤང་བ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་ལ་བརྩོན་པ་དང་། མི་བརྩོན་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤང་བ་དང་། ཆོས་རྣམས་ཀྱི་རང་གི་མཚན་ཉིད་ལ་བརྩོན་པ་དང་། མི་བརྩོན་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤང་བ་དང་། ཆོས་རྣམས་མཐའ་དང་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། མཐའ་རྣམས་གཅིག་ལ་གཅིག་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། ཆོས་རྣམས་དུས་གསུམ་དང་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། ཆོས་རྣམས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་། སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། ཆོས་ཐམས་ཅད་འབྱུང་བ་དང་།
en: Because the mark of form and so on does not exist, the totality of dharmas cannot be apprehended in that, and therefore it teaches, “In such as that,” where the totality of dharmas cannot be apprehended, “there is no form, there is no feeling, there is no perception,” up to “there is no buddha; there is no awakening.”

source: འཇིག་པ་དང་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། ཆོས་ཐམས་ཅད་རྟག་པ་ལ་སོགས་པ་དང་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། དེ་དག་ཉིད་རྣམ་པར་ཐར་པའི་སྒོ་རྣམས་དང་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། ཆོས་རྣམས་འདྲེས་པར་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། མངོན་པར་ཤེས་པ་དང་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། མངོན་པར་ཤེས་པའི་བྱ་བ་དང་སྦྱོར་བ་ཡོངས་སུ་སྤང་བ་དང་། འདུ་བ་དང་བྲལ་བའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤང་བ་དང་།
en: Having thus taught elevenfold the marks of the endeavor, it then teaches that they have forsaken the idea that they are “engaged” or “not engaged” with self;they have forsaken the idea that they are “engaged” or “not engaged” with the three gateways to liberation; they have forsaken the idea that they are “engaged” or “not engaged” with the marks particular to dharmas; they have forsaken joining dharmas with limits; they have forsaken joining limits one with the other; they have forsaken joining dharmas with the three time periods; they have forsaken joining dharmas with the knowledge of all aspects; they have forsaken joining all dharmas with originating and perishing; they have forsaken joining all dharmas with being permanent and so on; they have forsaken joining just those with the doors to liberation; they have forsaken joining dharmas in the various ways; they have forsaken joining with the clairvoyances; they have forsaken joining with the objects of the clairvoyances; they have forsaken the idea of coming together and separating; they have forsaken the idea of complete awakening; and they have forsaken the idea of joining with emptiness.

source: མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤང་བ་དང་། སྟོང་པ་ཉིད་ལ་སྦྱོར་བའི་རྣམ་པར་རྟོག་པ་ཡོངས་སུ་སྤང་བ་སྟེ། དེ་ལྟར་རྣམ་པ་བཅུ་དྲུག་གིས་སྟོང་པ་ཉིད་ལ་སྤྱོད་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བསྟན་ཏོ།
en: Thus, when they train in the practice of emptiness they endeavor at the perfection of wisdom in sixteen ways.

source: །དེ་ལ་གཟུགས་ལ་བརྩོན་ཞེས་བྱ་བ་འམ། མི་བརྩོན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ཞེས་བྱ་བ་ནི་བདག་ལ་བྱེད་པ་པོ་ལ་སོགས་པར་རྣམ་པར་རྟོག་པ་མེད་པ་དང་། ངར་འཛིན་པ་མི་འཇུག་པའི་ཕྱིར་རོ།
en: Among those, “they do not see the practice of the perfection of wisdom as either ‘engaged’ or ‘not engaged’ with form” because they do not entertain the idea that the self is an agent and so on, so grasping at “I” is not operating. “

source: །སྟོང་པ་ཉིད་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར་ཞེས་བྱ་བ་ནི་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་ན། གལ་ཏེ་སྟོང་པ་ཉིད་ཅེས་བྱ་བའི་ཆོས་གཞན་ཞིག་ཡོད་དོ་སྙམ་དུ་བསྒོམས་ན་ནི། དེའི་ཚེ་སྟོང་པ་ཉིད་ཀྱི་ངོ་བོ་ཉིད་དང་། སྟོང་པ་ཉིད་སྦྱོར་བར་འགྱུར་ན།
en: Neither cause emptiness to engage with emptiness”— were they, when they cultivate the emptiness meditative stabilization, to have cultivated it while thinking there is some other dharma “emptiness,” then an emptiness would be joining to an intrinsic nature of emptiness.

source: འདི་ལྟར་ཆོས་ཐམས་ཅད་དམིགས་སུ་མེད་པ་ཉིད་དེ་སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་ཡང་རྣམ་པ་མེད་པར་བསྒོམ་པ་སྟེ།
en: Since that is the case, even a meditation on the emptiness aspect that is that totality of dharmas that cannot be apprehended is aspectless.

source: དེའི་ཕྱིར་སྟོང་པ་ཉིད་དང་སྟོང་པ་ཉིད་དུ་མི་སྦྱོར་ཞེས་བྱའོ།
en: Hence it says they “neither cause emptiness to engage with emptiness.”

source: །སྟོང་པ་ཉིད་ཀྱི་རྣལ་འབྱོར་དང་ཡང་མ་ཡིན་ནོ་ཞེས་བྱ་བ་ལ་སྟོང་པ་ཉིད་ཀྱི་རྣལ་འབྱོར་ནི་སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ཏེ།
en: In “the yogic practice of emptiness as well,” the yogic practice of emptiness is the emptiness meditation stabilization.

source: སྟོང་པ་ཉིད་ཀྱི་རྣལ་འབྱོར་དེ་ཡང་སྟོང་པ་ཉིད་ཀྱི་རྣལ་འབྱོར་གྱི་ངོ་བོ་ཉིད་གཞན་དང་མི་སྦྱོར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means they do not join the yogic practice of emptiness to another inherently existing yogic practice of emptiness.

source: །དེ་བཞིན་དུ་མཚན་མ་མེད་པའི་ཆོས་གཞན་དུ་རྣམ་པར་རྟོག་པ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་གཞན་དུ་རྣམ་པར་རྟོག་པ་མེད་པའི་ཕྱིར་ཞེས་བྱ་བ་དང་ཡང་སྦྱར་བར་བྱའོ།
en: Similarly connect this with: because they do not entertain the idea of some other dharma, “signlessness”; and because they do not entertain the idea there is some other dharma, “wishlessness.”

source: །དེའི་ཕྱིར་སྟོང་པ་ཉིད་ནི་རྣལ་འབྱོར་ཡང་མ་ཡིན། རྣལ་འབྱོར་མ་ཡིན་པ་ཡང་མ་ཡིན་ཞེས་གསུངས་ཏེ།
en: Therefore, it says “emptiness is neither a yogic practice nor not a yogic practice.”

source: འདི་ལྟར་སྟོང་པ་ཉིད་ནི་གཟུགས་ལ་སོགས་པ་ཀུན་བརྟགས་པ་གཞན་ཐམས་ཅད་ཀྱི་རྣལ་འབྱོར་གྱི་རྣམ་པ་དང་བྲལ་བ་སྟེ། དེའི་ཕྱིར་རྣལ་འབྱོར་མ་ཡིན་ནོ། །འདི་ལྟར་བདག་ཉིད་ཀྱིས་བརྗོད་དུ་མེད་ཅིང་མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱི་ངོ་བོ་ཉིད་ཡིན་ཏེ། དེའི་ཕྱིར་རྣལ་འབྱོར་མ་ཡིན་པ་ཡང་མ་ཡིན་ནོ།
en: Because emptiness is separated from the cognitive dimension of a yogic practice of any other imaginary phenomena such as form and so on, it is, therefore, not a yogic practice; and because it is in its nature inexpressible and the intrinsic nature of the signlessness meditative stabilization, it is, therefore, not not a yogic practice.
